%syms s t
%solve('7+(sqrt((s-0.306*t)^2+37^2-2*37*(s-0.306*t)*cos(25*pi/180))/0.816)=t',t)

clear all;
clc;
close all;

s=16.0170:0.1:46.0027
%s<16.0170
figure(1)

 tA=2.3272727272727272727272727272727e-64.*(3.7545655517108804306036139946175e127.*s.^2 - 2.6789116656120879469415645650043e129.*s + 5.5674977600942823922165297766035e130).^(1/2) - 0.53475935828877005347593582887701.*s + 26.077747657944411037419491069471
plot(s,tA,'b','LineWidth',3);
hold on;
tD=2.3272727272727272727272727272727e-64.*(3.7545655517108804306036139946175e127*s.^2 + 2.6069603509913993937814921613332e129.*s + 4.5588721973402245859333523686852e130).^(1/2) - 0.53475935828877005347593582887701.*s - 11.565349641387478446478815450018
plot(s,tD,'r','LineWidth',3);
hold on;

tB=2.3272727272727272727272727272727e-64.*(3.7545655517108804306036139946175e127.*s.^2 - 8.7994286067807966038522270521628e128.*s + 4.6368641634354540445699335148361e130).^(1/2) - 0.53475935828877005347593582887701.*s + 13.266473084916186206903345985075;
plot(s,tB,'b','LineWidth',3);
hold on;

tC=  2.3272727272727272727272727272727e-64.*(3.7545655517108804306036139946175e127.*s.^2 + 1.4327668553702831810479428566062e129.*s + 4.3308605272739264873172149181668e130).^(1/2) - 0.53475935828877005347593582887701.*s - 3.203384034753318479142877419555
plot(s,tC,'b','LineWidth',3);
hold on;




s1=13.75:0.1:46.0027
tO=(s1+0.816*7)/(0.816+0.306);

plot(s1,tO,'b','LineWidth',3);

hold on;
min=10;
flag=0;
for i=1:300
   x=abs(s(1,i)-0.306*tA(1,i)-10);
   if x<min
       min=x;
       flag=i;
   end
end

plot(s(1,1:flag),tA(1,1:flag),'r','LineWidth',3);
hold on;
min=10;
flag=0;
for i=1:300
   x=abs(s(1,i)-0.306*tB(1,i)-10);
   if x<min
       min=x;
       flag=i;
   end
end

plot(s(1,1:flag),tB(1,1:flag),'r','LineWidth',3);
hold on;
min=10;
flag=0;
for i=1:300
   x=abs(s(1,i)-0.306*tC(1,i)-15.7818);
   if x<min
       min=x;
       flag=i;
   end
end
plot(s(1,1:flag),tC(1,1:flag),'r','LineWidth',3);
hold on;
grid on;
title('存在避免误伤情况下的关系图','fontsize',16);xlabel('导弹探测点与指挥舰距离','fontsize',16);ylabel('各舰完成拦截该导弹任务时间','fontsize',16)
legend( '允许防御区域','为避免误伤的禁止防御区域');
  text(42,23,'A护卫舰','color','black','fontsize',16);
text(42,52,'B护卫舰','color','black','fontsize',16);
text(42,67,'C护卫舰','color','black','fontsize',16);
text(33,72,'D护卫舰','color','black','fontsize',16);
text(42,42,'指挥舰','color','black','fontsize',16);

